espressif/arduino-esp32/libraries/Matter/src/Matter.cpp
// Copyright 2026 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <sdkconfig.h>
#ifdef CONFIG_ESP_MATTER_ENABLE_DATA_MODEL

#include <Matter.h>
#include <app/server/CommissioningWindowManager.h>
#include <app/server/Server.h>
#include <platform/ConnectivityManager.h>
#if CONFIG_ENABLE_MATTER_OVER_THREAD
#include "esp_openthread_types.h"
#include "platform/ESP32/OpenthreadLauncher.h"
#if defined(CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
#include <app/clusters/general-commissioning-server/BreadCrumbTracker.h>
#include <app/clusters/general-commissioning-server/CodegenIntegration.h>
#include <app/clusters/network-commissioning/NetworkCommissioningCluster.h>
#include <app/server-cluster/ServerClusterInterfaceRegistry.h>
#include <data_model_provider/esp_matter_data_model_provider.h>
#include <platform/DeviceControlServer.h>
#include <platform/OpenThread/GenericNetworkCommissioningThreadDriver.h>
#endif
#endif

// This prevents initArduino() from releasing BLE memory before the
// Matter stack can use Bluetooth transport.
#if CONFIG_ENABLE_CHIPOBLE
#include "esp32-hal-alloc-ble-mem.h"
#include "esp32-hal-bt.h"
#include <platform/internal/BLEManager.h>
#endif

#if defined(SOC_WIFI_SUPPORTED) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
#include <esp_wifi.h>
#endif

#include <app/server/Dnssd.h>
#include <esp_event.h>
#include <esp_netif.h>
#include <stdio.h>
#include <string.h>
#include <system/SystemLayer.h>

using namespace esp_matter;
using namespace esp_matter::attribute;
using namespace esp_matter::endpoint;
using namespace esp_matter::identification;
using namespace chip::app::Clusters;

constexpr auto k_timeout_seconds = 300;

// Two-phase lifecycle. Endpoint begin() creates the node (NodeCreated).
// Matter.begin() starts the CHIP stack (StackStarted). These are not the same:
// identity setters are valid after the node exists and invalid after the stack starts.
enum class MatterLifecycle : uint8_t {
  Uninitialized,
  NodeCreated,
  StackStarted
};
static MatterLifecycle sLifecycle = MatterLifecycle::Uninitialized;
static node::config_t node_config;
static node_t *deviceNode = nullptr;
ArduinoMatter::matterEventCB ArduinoMatter::_matterEventCB = nullptr;
ArduinoMatter::bleMemoryReleasedCB ArduinoMatter::_bleMemoryReleasedCB = nullptr;
#if CONFIG_ENABLE_CHIPOBLE
static bool sBleCommissioningEnabled = true;
#else
static bool sBleCommissioningEnabled = false;
#endif
static bool sBleMemoryReleaseEnabled = true;
static matterNetwork_t sSelectedNetwork = MATTER_NETWORK_NONE;
static esp_event_handler_instance_t sIpEventHandler = nullptr;

static bool netifHasUsableIpv6(const char *ifkey) {
  if (ifkey == nullptr) {
    return false;
  }
  esp_netif_t *netif = esp_netif_get_handle_from_ifkey(ifkey);
  if (netif == nullptr || !esp_netif_is_netif_up(netif)) {
    return false;
  }
  esp_ip6_addr_t addr;
  if (esp_netif_get_ip6_linklocal(netif, &addr) == ESP_OK) {
    return true;
  }
  if (esp_netif_get_ip6_global(netif, &addr) == ESP_OK) {
    return true;
  }
  return false;
}

static bool ethernetHasUsableIpv6() {
  if (netifHasUsableIpv6("ETH_DEF")) {
    return true;
  }
  char key[16];
  for (int i = 1; i <= 8; i++) {
    snprintf(key, sizeof(key), "ETH_%d", i);
    if (netifHasUsableIpv6(key)) {
      return true;
    }
  }
  return false;
}

static bool selectedHasUsableIpv6() {
  switch (sSelectedNetwork) {
    case MATTER_NETWORK_WIFI:     return netifHasUsableIpv6("WIFI_STA_DEF");
    case MATTER_NETWORK_THREAD:   return netifHasUsableIpv6("OT_DEF");
    case MATTER_NETWORK_ETHERNET: return ethernetHasUsableIpv6();
    default:                      return netifHasUsableIpv6("WIFI_STA_DEF") || netifHasUsableIpv6("OT_DEF") || ethernetHasUsableIpv6();
  }
}

static void startDnssdWork(intptr_t) {
  chip::app::DnssdServer::Instance().StartServer();
}

static void scheduleChipWork(chip::DeviceLayer::AsyncWorkFunct work, const char *what) {
  const CHIP_ERROR err = chip::DeviceLayer::PlatformMgr().ScheduleWork(work, 0);
  if (err != CHIP_NO_ERROR) {
    log_e("Failed to schedule %s: %" CHIP_ERROR_FORMAT, what, err.Format());
  }
}

static void scheduleDnssdRestart() {
  if (sLifecycle != MatterLifecycle::StackStarted) {
    return;
  }
  scheduleChipWork(startDnssdWork, "DNS-SD restart");
}

#if CONFIG_ENABLE_MATTER_OVER_THREAD
// Thread commissionable ads are OpenThread SRP (_matterc._udp), proxied as LAN
// mDNS by the border router. On ESP32-C6, ChipDnssdInit also runs Wi-Fi mDNS
// and posts kDnssdInitialized immediately — that is not SRP. StartServer()
// before the OTBR answers ClearSrpHost returns CHIP_ERROR_UNINITIALIZED and
// never publishes. After attach, retry for ~24 s so a late SRP server still
// gets advertised. Safe from the ESP-IDF IP task: work runs on the CHIP task.
static constexpr uint8_t kThreadAdvertiseMaxRetries = 8;
static uint8_t sThreadAdvertiseRetriesLeft = 0;
static bool sThreadAdvertiseTimerArmed = false;

static void threadAdvertiseRetryTimer(chip::System::Layer *, void *) {
  sThreadAdvertiseTimerArmed = false;
  if (sLifecycle != MatterLifecycle::StackStarted || sSelectedNetwork != MATTER_NETWORK_THREAD) {
    return;
  }
  chip::app::DnssdServer::Instance().StartServer();
  if (sThreadAdvertiseRetriesLeft == 0) {
    return;
  }
  sThreadAdvertiseRetriesLeft--;
  sThreadAdvertiseTimerArmed = true;
  chip::DeviceLayer::SystemLayer().StartTimer(chip::System::Clock::Seconds16(3), threadAdvertiseRetryTimer, nullptr);
}

static void startThreadAdvertiseRetriesWork(intptr_t) {
  if (sLifecycle != MatterLifecycle::StackStarted || sSelectedNetwork != MATTER_NETWORK_THREAD) {
    return;
  }
  chip::app::DnssdServer::Instance().StartServer();
  sThreadAdvertiseRetriesLeft = kThreadAdvertiseMaxRetries;
  if (!sThreadAdvertiseTimerArmed) {
    sThreadAdvertiseTimerArmed = true;
    chip::DeviceLayer::SystemLayer().StartTimer(chip::System::Clock::Seconds16(3), threadAdvertiseRetryTimer, nullptr);
  }
}

static void startThreadAdvertiseRetries() {
  if (sLifecycle != MatterLifecycle::StackStarted) {
    return;
  }
  scheduleChipWork(startThreadAdvertiseRetriesWork, "Thread advertise retries");
}
#endif

static bool ifkeyMatchesSelection(esp_netif_t *netif) {
  if (netif == nullptr) {
    return false;
  }
  const char *key = esp_netif_get_ifkey(netif);
  if (key == nullptr) {
    return false;
  }
  switch (sSelectedNetwork) {
    case MATTER_NETWORK_WIFI:     return strcmp(key, "WIFI_STA_DEF") == 0;
    case MATTER_NETWORK_THREAD:   return strcmp(key, "OT_DEF") == 0;
    case MATTER_NETWORK_ETHERNET: return strncmp(key, "ETH_", 4) == 0;
    default:                      return true;
  }
}

static void matterIpEventHandler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data) {
  (void)arg;
  (void)event_base;
  if (event_id != IP_EVENT_GOT_IP6 || event_data == nullptr) {
    return;
  }
  const ip_event_got_ip6_t *event = static_cast<const ip_event_got_ip6_t *>(event_data);
  if (!ifkeyMatchesSelection(event->esp_netif)) {
    return;
  }
#if CONFIG_ENABLE_MATTER_OVER_THREAD
  if (sSelectedNetwork == MATTER_NETWORK_THREAD) {
    startThreadAdvertiseRetries();
    return;
  }
#endif
  scheduleDnssdRestart();
}

#if CONFIG_ENABLE_MATTER_OVER_THREAD && defined(CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
// The C6 prebuild can bind Thread NC to Kconfig endpoint 2, but Arduino does not
// create that endpoint. C6 is Wi-Fi or Thread on the root: after start(), replace
// the Wi-Fi driver on endpoint 0 with the Thread driver.
// NetworkCommissioning commands carry a breadcrumb. CHIP writes it through this
// tracker into GeneralCommissioning.Breadcrumb so the hub can see fail/success.
// The Wi-Fi NC on root already uses ESP-Matter's tracker; this one is only for
// the Thread cluster Arduino puts on endpoint 0.
class MatterBreadcrumbTracker : public chip::app::Clusters::BreadCrumbTracker {
  void SetBreadCrumb(uint64_t value) override {
    GeneralCommissioningCluster *cluster = GeneralCommissioning::Instance();
    if (cluster == nullptr) {
      log_e("General Commissioning cluster not available; Thread NC breadcrumb not set");
      return;
    }
    cluster->SetBreadCrumb(value);
  }
};

