espressif/arduino-esp32/libraries/Matter/src/Matter.cpp
static MatterBreadcrumbTracker sThreadNcBreadcrumb;
static chip::DeviceLayer::NetworkCommissioning::GenericThreadDriver sThreadNcDriver;
static chip::app::LazyRegisteredServerCluster<chip::app::Clusters::NetworkCommissioningCluster> sThreadNcOnRoot;

static void bindThreadNetworkCommissioningOnRoot() {
  if (sSelectedNetwork != MATTER_NETWORK_THREAD) {
    return;
  }
  lock::ScopedChipStackLock stackLock(portMAX_DELAY);
  auto &registry = esp_matter::data_model::provider::get_instance().registry();
  const chip::app::ConcreteClusterPath path(0, NetworkCommissioning::Id);
  chip::app::ServerClusterInterface *existing = registry.Get(path);
  if (existing != nullptr) {
    (void)registry.Unregister(existing);
    static_cast<chip::app::Clusters::NetworkCommissioningCluster *>(existing)->Deinit();
  }
  if (!sThreadNcOnRoot.IsConstructed()) {
    const chip::app::Clusters::NetworkCommissioningCluster::Context context{
      .breadcrumbTracker = sThreadNcBreadcrumb,
      .failSafeContext = chip::Server::GetInstance().GetFailSafeContext(),
      .platformManager = chip::DeviceLayer::PlatformMgr(),
      .deviceControlServer = chip::DeviceLayer::DeviceControlServer::DeviceControlSvr(),
    };
    sThreadNcOnRoot.Create(0, &sThreadNcDriver, context);
  }
  CHIP_ERROR err = sThreadNcOnRoot.Cluster().Init();
  if (err != CHIP_NO_ERROR) {
    log_e("Thread Network Commissioning Init on endpoint 0 failed: %" CHIP_ERROR_FORMAT, err.Format());
    return;
  }
  err = registry.Register(sThreadNcOnRoot.Registration());
  if (err != CHIP_NO_ERROR) {
    log_e("Failed to register Thread Network Commissioning on endpoint 0: %" CHIP_ERROR_FORMAT, err.Format());
    return;
  }
  log_i("Thread Network Commissioning is on endpoint 0 (replaced Wi-Fi)");
}

static void hideRootWiFiDiagnostics() {
  endpoint_t *root = endpoint::get(node::get(), 0);
  if (root == nullptr) {
    return;
  }
  cluster_t *wifiDiag = cluster::get(root, WiFiNetworkDiagnostics::Id);
  if (wifiDiag != nullptr) {
    cluster::destroy(wifiDiag);
  }
}
#endif

static void registerMatterIpEventHandler() {
  if (sIpEventHandler != nullptr) {
    return;
  }
  const esp_err_t err = esp_event_handler_instance_register(IP_EVENT, ESP_EVENT_ANY_ID, matterIpEventHandler, nullptr, &sIpEventHandler);
  if (err != ESP_OK) {
    log_e("Failed to register IP event handler for Matter DNS-SD: %s", esp_err_to_name(err));
  }
}

// Reports the reclaim to the sketch exactly once, whether Arduino or CHIP did it.
static bool sBleMemoryReleasedNotified = false;

static void notifyBleMemoryReleased() {
  if (sBleMemoryReleasedNotified) {
    return;
  }
  sBleMemoryReleasedNotified = true;
  if (ArduinoMatter::_bleMemoryReleasedCB != nullptr) {
    ArduinoMatter::_bleMemoryReleasedCB();
  }
}

#if CONFIG_ENABLE_CHIPOBLE
// esp_bt_mem_release() corrupts the heap while the NimBLE host task is still running,
// so poll for its exit the way CHIP does. Bounded, so a host that never exits cannot
// leave a timer rearming forever.
static constexpr uint8_t kClaimBleMemoryMaxRetries = 15;  // 15 x 2 s
static uint8_t sClaimBleMemoryRetries = 0;

static void claimBleMemoryTimer(chip::System::Layer *, void *);

// BLEMgr().Shutdown() deinits the CHIPoBLE host but does not return the BLE RAM to the
// heap. That step is BLEManagerImpl::ClaimBLEMemory(), which CHIP compiles in only when
// CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING is set, and whose target list omits ESP32-C5 even
// then (still true in esp-matter 1.6 and CHIP master). Every prebuilt Arduino library is
// built with that option off, so CHIP neither reclaims nor posts kBLEDeinitialized.
// Finish the job here. btMemRelease() only acts on regions that are still reserved, so
// builds where CHIP does reclaim are unaffected.
static void claimBleMemory() {
  if (xTaskGetHandle("nimble_host") != nullptr) {
    if (++sClaimBleMemoryRetries > kClaimBleMemoryMaxRetries) {
      log_e("NimBLE host is still running; BLE memory was not reclaimed.");
      return;
    }
    chip::DeviceLayer::SystemLayer().StartTimer(chip::System::Clock::Seconds32(2), claimBleMemoryTimer, nullptr);
    return;
  }
#ifdef CONFIG_IDF_TARGET_ESP32
  const bt_mode releaseMode = BT_MODE_BTDM;  // NimBLE reserves both regions on the original ESP32
#else
  const bt_mode releaseMode = BT_MODE_BLE;
#endif
  if (!btMemReleased(releaseMode) && !btMemRelease(releaseMode)) {
    log_e("Failed to release BLE memory; it stays reserved.");
    return;
  }
  log_d("BLE memory reclaimed");
  // The RAM is on the heap now, so report it regardless of what the event queue does.
  notifyBleMemoryReleased();
  // CHIP posts kBLEDeinitialized only from its own ClaimBLEMemory(), which this build
  // does not compile in. Post it here so onEvent(MATTER_BLE_DEINITIALIZED) stays in
  // step with the callback above. notifyBleMemoryReleased() is one-shot, so neither
  // this dispatch nor a build where CHIP also posts reports a second time.
  chip::DeviceLayer::ChipDeviceEvent event = {};
  event.Type = chip::DeviceLayer::DeviceEventType::kBLEDeinitialized;
  if (chip::DeviceLayer::PlatformMgr().PostEvent(&event) != CHIP_NO_ERROR) {
    log_e("Failed to post BLE deinit event; onEvent(MATTER_BLE_DEINITIALIZED) will not fire.");
  }
}

// CHIP timers require the System::TimerCompleteCallback signature.
static void claimBleMemoryTimer(chip::System::Layer *, void *) {
  claimBleMemory();
}

// Runs on the CHIP task: _Shutdown() must not run from setup().
static void shutdownChipBleWork(intptr_t) {
  chip::DeviceLayer::Internal::BLEMgr().Shutdown();
  // Shutdown() only schedules the state machine that deinits the host, so arm the
  // reclaim poll rather than releasing here.
  sClaimBleMemoryRetries = 0;
  claimBleMemory();
}
#endif

static void scheduleShutdownChipBle() {
#if CONFIG_ENABLE_CHIPOBLE
  scheduleChipWork(shutdownChipBleWork, "CHIPoBLE shutdown");
#endif
}

#if defined(CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
// Dual-stack images must init the Wi-Fi controller (InitChipStack → EnableStationMode).
// Thread/Ethernet still must not join a leftover STA. Disable after start().
static void disableWiFiStationIfNotSelected() {
  if (sSelectedNetwork != MATTER_NETWORK_THREAD && sSelectedNetwork != MATTER_NETWORK_ETHERNET) {
    return;
  }
  lock::ScopedChipStackLock stackLock(portMAX_DELAY);
  const CHIP_ERROR err =
    chip::DeviceLayer::ConnectivityMgr().SetWiFiStationMode(chip::DeviceLayer::ConnectivityManager::kWiFiStationMode_Disabled);
  if (err != CHIP_NO_ERROR) {
    log_w("Failed to disable Wi-Fi station: %" CHIP_ERROR_FORMAT, err.Format());
  }
}
#endif

#if CONFIG_ENABLE_CHIPOBLE
static void ensureChiPoBleAdvertising() {
  if (!ArduinoMatter::isBLECommissioningEnabled() || ArduinoMatter::isDeviceCommissioned()) {
    return;
  }
  lock::ScopedChipStackLock stackLock(portMAX_DELAY);
  const CHIP_ERROR bleErr = chip::DeviceLayer::ConnectivityMgr().SetBLEAdvertisingEnabled(true);
  if (bleErr != CHIP_NO_ERROR && bleErr != CHIP_ERROR_UNSUPPORTED_CHIP_FEATURE) {
    log_w("SetBLEAdvertisingEnabled failed: %" CHIP_ERROR_FORMAT, bleErr.Format());
  }
  chip::CommissioningWindowManager &mgr = chip::Server::GetInstance().GetCommissioningWindowManager();
  if (mgr.IsCommissioningWindowOpen() || !chip::Server::GetInstance().GetFailSafeContext().IsFailSafeFullyDisarmed()) {
    return;
  }
  const CHIP_ERROR err = mgr.OpenBasicCommissioningWindow(
    chip::System::Clock::Seconds32(k_timeout_seconds), chip::CommissioningWindowAdvertisement::kAllSupported
  );
  if (err != CHIP_NO_ERROR) {
    log_e("Failed to open CHIPoBLE commissioning window: %" CHIP_ERROR_FORMAT, err.Format());
  }
}
#endif

#if defined(SOC_WIFI_SUPPORTED) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
// Matter exchanges little data with a controller. Init Wi-Fi here with smaller
// buffers so CHIP's InitWiFiStack() (WIFI_INIT_CONFIG_DEFAULT from sdkconfig)
// becomes a no-op: the first esp_wifi_init() owns the counts.
// IDF requires rx_ba_win <= dynamic_rx_buf_num and <= 2 * static_rx_buf_num.
// 6 is the IDF default and the Memory saving rank for Matter-sized traffic.
static constexpr int kMatterWifiStaticRxBufNum = 4;
static constexpr int kMatterWifiDynamicRxBufNum = 8;
static constexpr int kMatterWifiDynamicTxBufNum = 8;
static constexpr int kMatterWifiCacheTxBufNum = 4;
static constexpr int kMatterWifiRxBaWin = 6;

static void initMatterWiFiStack() {
  if (sSelectedNetwork == MATTER_NETWORK_THREAD || sSelectedNetwork == MATTER_NETWORK_ETHERNET) {
    return;
  }
  wifi_mode_t mode;
  if (esp_wifi_get_mode(&mode) != ESP_ERR_WIFI_NOT_INIT) {
    log_d("Wi-Fi already initialized; Matter buffer limits were not applied.");
    return;
  }

