espressif/arduino-esp32/libraries/Matter/src/Matter.cpp
  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  cfg.static_rx_buf_num = kMatterWifiStaticRxBufNum;
  cfg.dynamic_rx_buf_num = kMatterWifiDynamicRxBufNum;
  cfg.tx_buf_type = 1;
  cfg.static_tx_buf_num = 0;
  cfg.dynamic_tx_buf_num = kMatterWifiDynamicTxBufNum;
  if (cfg.cache_tx_buf_num < kMatterWifiCacheTxBufNum) {
    cfg.cache_tx_buf_num = kMatterWifiCacheTxBufNum;
  }
  cfg.rx_ba_win = kMatterWifiRxBaWin;

  const esp_err_t err = esp_wifi_init(&cfg);
  if (err != ESP_OK) {
    log_e("esp_wifi_init failed: %s", esp_err_to_name(err));
    return;
  }
  log_d(
    "Wi-Fi initialized with Matter buffer limits (static_rx=%d, dynamic_rx=%d, dynamic_tx=%d, rx_ba_win=%d)", kMatterWifiStaticRxBufNum,
    kMatterWifiDynamicRxBufNum, kMatterWifiDynamicTxBufNum, cfg.rx_ba_win
  );
}
#endif

// This callback is called for every attribute update. The callback implementation shall
// handle the desired attributes and return an appropriate error code. If the attribute
// is not of your interest, please do not return an error code and strictly return ESP_OK.
static esp_err_t app_attribute_update_cb(
  attribute::callback_type_t type, uint16_t endpoint_id, uint32_t cluster_id, uint32_t attribute_id, esp_matter_attr_val_t *val, void *priv_data
) {
  log_d(
    "Attribute update callback: type: %u, endpoint: %u, cluster: %" PRIu32 ", attribute: %" PRIu32 ", val: %u", type, endpoint_id, cluster_id, attribute_id,
    val != nullptr ? val->val.u32 : 0u
  );
  esp_err_t err = ESP_OK;
  MatterEndPoint *ep = (MatterEndPoint *)priv_data;  // endpoint pointer to base class
  switch (type) {
    case PRE_UPDATE:  // Callback before updating the value in the database
      log_v("Attribute update callback: PRE_UPDATE");
      if (ep != nullptr) {
        err = ep->attributeChangeCB(endpoint_id, cluster_id, attribute_id, val) ? ESP_OK : ESP_FAIL;
      }
      break;
    case POST_UPDATE:  // Callback after updating the value in the database
      log_v("Attribute update callback: POST_UPDATE");
      break;
    case READ:  // Callback for reading the attribute value. This is used when the `ATTRIBUTE_FLAG_OVERRIDE` is set.
      log_v("Attribute update callback: READ");
      break;
    case WRITE:  // Callback for writing the attribute value. This is used when the `ATTRIBUTE_FLAG_OVERRIDE` is set.
      log_v("Attribute update callback: WRITE");
      break;
    default: log_v("Attribute update callback: Unknown type %d", type);
  }
  return err;
}

// This callback is invoked when clients interact with the Identify Cluster.
// In the callback implementation, an endpoint can identify itself. (e.g., by flashing an LED or light).
static esp_err_t app_identification_cb(identification::callback_type_t type, uint16_t endpoint_id, uint8_t effect_id, uint8_t effect_variant, void *priv_data) {
  log_d("Identification callback to endpoint %u: type: %u, effect: %u, variant: %u", endpoint_id, type, effect_id, effect_variant);
  esp_err_t err = ESP_OK;
  MatterEndPoint *ep = (MatterEndPoint *)priv_data;  // endpoint pointer to base class
  // Identify the endpoint sending a counter to the application
  bool identifyIsActive = false;

  if (type == identification::callback_type_t::START) {
    log_v("Identification callback: START");
    identifyIsActive = true;
  } else if (type == identification::callback_type_t::EFFECT) {
    // TriggerEffect does not send START. Blink/Breathe/Okay/ChannelChange are
    // identify feedback. StopEffect/FinishEffect end it. CHIP does not send STOP
    // after a one-shot effect while IdentifyTime is 0; sketches that latch a
    // flag should time the animation out themselves.
    using EffectId = chip::app::Clusters::Identify::EffectIdentifierEnum;
    const EffectId effect = static_cast<EffectId>(effect_id);
    identifyIsActive = (effect != EffectId::kStopEffect && effect != EffectId::kFinishEffect);
    log_v("Identification callback: EFFECT id %u active %u", effect_id, identifyIsActive);
  } else if (type == identification::callback_type_t::STOP) {
    identifyIsActive = false;
    log_v("Identification callback: STOP");
  }
  if (ep != nullptr) {
    if (ep->getEndPointId() != endpoint_id) {
      log_w("Identify priv_data is not the MatterEndPoint for endpoint %u", endpoint_id);
      return ESP_ERR_INVALID_ARG;
    }
    MatterIdentifyRequest request;
    request.active = identifyIsActive;
    request.effectId = effect_id;
    request.effectVariant = effect_variant;
    request.fromTriggerEffect = (type == identification::callback_type_t::EFFECT);
    err = ep->endpointIdentifyCB(endpoint_id, request) ? ESP_OK : ESP_FAIL;
  }

  return err;
}

// This callback is invoked for all Matter events. The application can handle the events as required.
static void app_event_cb(const ChipDeviceEvent *event, intptr_t arg) {
  switch (event->Type) {
    case chip::DeviceLayer::DeviceEventType::kInterfaceIpAddressChanged:
      log_d(
        "Interface %s Address changed", event->InterfaceIpAddressChanged.Type == chip::DeviceLayer::InterfaceIpChangeType::kIpV4_Assigned ? "IPv4" : "IPV6"
      );
      break;
    case chip::DeviceLayer::DeviceEventType::kCommissioningComplete:
      log_d("Commissioning complete");
      if (ArduinoMatter::isBLEMemoryReleaseEnabled()) {
        scheduleShutdownChipBle();
      }
      break;
    case chip::DeviceLayer::DeviceEventType::kFailSafeTimerExpired:        log_d("Commissioning failed, fail safe timer expired"); break;
    case chip::DeviceLayer::DeviceEventType::kCommissioningSessionStarted: log_d("Commissioning session started"); break;
    case chip::DeviceLayer::DeviceEventType::kCommissioningSessionStopped: log_d("Commissioning session stopped"); break;
    case chip::DeviceLayer::DeviceEventType::kCommissioningWindowOpened:   log_d("Commissioning window opened"); break;
    case chip::DeviceLayer::DeviceEventType::kCommissioningWindowClosed:   log_d("Commissioning window closed"); break;
    case chip::DeviceLayer::DeviceEventType::kFabricRemoved:
    {
      log_d("Fabric removed successfully");
      if (chip::Server::GetInstance().GetFabricTable().FabricCount() == 0) {
        log_d("No fabric left, opening commissioning window");
        chip::CommissioningWindowManager &commissionMgr = chip::Server::GetInstance().GetCommissioningWindowManager();
        constexpr auto kTimeoutSeconds = chip::System::Clock::Seconds16(k_timeout_seconds);
        if (!commissionMgr.IsCommissioningWindowOpen()) {
          // After removing last fabric, it does not remove the Wi-Fi credentials and still has IP connectivity so, only advertising on DNS-SD.
          CHIP_ERROR err = commissionMgr.OpenBasicCommissioningWindow(kTimeoutSeconds, chip::CommissioningWindowAdvertisement::kDnssdOnly);
          if (err != CHIP_NO_ERROR) {
            log_e("Failed to open commissioning window, err:%" CHIP_ERROR_FORMAT, err.Format());
          }
        }
      }
      break;
    }
    case chip::DeviceLayer::DeviceEventType::kFabricWillBeRemoved: log_d("Fabric will be removed"); break;
    case chip::DeviceLayer::DeviceEventType::kFabricUpdated:       log_d("Fabric is updated"); break;
    case chip::DeviceLayer::DeviceEventType::kFabricCommitted:     log_d("Fabric is committed"); break;
    case chip::DeviceLayer::DeviceEventType::kBLEDeinitialized:
      log_d("BLE deinitialized and memory reclaimed");
      notifyBleMemoryReleased();
      break;
    case chip::DeviceLayer::DeviceEventType::kThreadConnectivityChange:
#if CONFIG_ENABLE_MATTER_OVER_THREAD
      if (sSelectedNetwork == MATTER_NETWORK_THREAD && event->ThreadConnectivityChange.Result == chip::DeviceLayer::kConnectivity_Established) {
        startThreadAdvertiseRetries();
      }
#endif
      break;
    case chip::DeviceLayer::DeviceEventType::kDnssdInitialized:
#if CONFIG_ENABLE_MATTER_OVER_THREAD
      if (sSelectedNetwork == MATTER_NETWORK_THREAD) {
#if defined(CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
        // ESP32-C6: EspDnssdInit posts this as soon as Wi-Fi mDNS starts. Thread
        // SRP posts the same event later, after attach + OTBR ClearSrpHost.
        if (!chip::DeviceLayer::ConnectivityMgr().IsThreadAttached()) {
          log_d("Matter DNS-SD initialized (Wi-Fi mDNS); Thread SRP is not ready yet");
          break;
        }
#endif
        log_i("Matter DNS-SD initialized (Thread SRP ready)");
        startThreadAdvertiseRetries();
        break;
      }
#endif
      log_i("Matter DNS-SD initialized");
      break;
    default: break;
  }
  // Check if the user-defined callback is set
  if (ArduinoMatter::_matterEventCB != nullptr) {
    ArduinoMatter::_matterEventCB(static_cast<matterEvent_t>(event->Type), event);
  }
}

