espressif/arduino-esp32/libraries/Matter/src/Matter.cpp
bool ArduinoMatter::isStackStarted() {
  return sLifecycle == MatterLifecycle::StackStarted;
}

static bool matterHasAccessoryEndpoint() {
  node_t *node = node::get();
  if (node == nullptr) {
    return false;
  }
  for (endpoint_t *ep = endpoint::get_first(node); ep != nullptr; ep = endpoint::get_next(ep)) {
    if (endpoint::get_id(ep) != 0) {
      return true;
    }
  }
  return false;
}

bool ArduinoMatter::initNode() {
  if (sLifecycle != MatterLifecycle::Uninitialized) {
    return true;
  }

#if CONFIG_ENABLE_MATTER_OVER_THREAD && defined(CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
#ifndef CONFIG_CUSTOM_NETWORK_CONFIG
  if (sSelectedNetwork == MATTER_NETWORK_THREAD) {
    node_config.root_node.network_commissioning.feature_map = chip::to_underlying(NetworkCommissioning::Feature::kThreadNetworkInterface);
  }
#endif
#endif

  // Create a Matter node and add the mandatory Root Node device type on endpoint 0
  // node handle can be used to add/modify other endpoints.
  deviceNode = node::create(&node_config, app_attribute_update_cb, app_identification_cb);
  if (deviceNode == nullptr) {
    log_e("Failed to create Matter node");
    return false;
  }

#if CONFIG_ENABLE_MATTER_OVER_THREAD && defined(CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
  if (sSelectedNetwork == MATTER_NETWORK_THREAD) {
    hideRootWiFiDiagnostics();
  }
#endif

  sLifecycle = MatterLifecycle::NodeCreated;
  return true;
}

void ArduinoMatter::begin() {
  if (sLifecycle == MatterLifecycle::StackStarted) {
    return;
  }
  if (sLifecycle != MatterLifecycle::NodeCreated) {
    log_e("Matter node has not been created. Call at least one endpoint begin() first.");
    return;
  }
  if (!matterHasAccessoryEndpoint()) {
    log_e("No Matter accessory endpoint on the node. At least one endpoint begin() must succeed before Matter.begin().");
    return;
  }

#if defined(CONFIG_BT_CONTROLLER_ENABLED) && CONFIG_ENABLE_CHIPOBLE
  if (isBLECommissioningEnabled() && btMemReleased(BT_MODE_BLE)) {
    log_w("BLE memory has been released; commissioning will use the IP network.");
  }
#endif

#if defined(SOC_WIFI_SUPPORTED) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
  initMatterWiFiStack();
#endif

  if (sSelectedNetwork == MATTER_NETWORK_ETHERNET && !ethernetHasUsableIpv6()) {
    log_e("Ethernet selected but no usable IPv6 address. Call ETH.begin(), enableIPv6(), and waitForNetwork() before Matter.begin().");
    return;
  }

#if CONFIG_ENABLE_MATTER_OVER_THREAD
  // Set OpenThread platform config
  esp_openthread_platform_config_t config;
  memset(&config, 0, sizeof(esp_openthread_platform_config_t));
  config.radio_config.radio_mode = RADIO_MODE_NATIVE;
  config.host_config.host_connection_mode = HOST_CONNECTION_MODE_NONE;
  config.port_config.storage_partition_name = "nvs";
  config.port_config.netif_queue_size = 10;
  config.port_config.task_queue_size = 10;
  set_openthread_platform_config(&config);
#endif

  applyIdentityBeforeStart();

  /* Matter start */
  esp_err_t err = esp_matter::start(app_event_cb);
  if (err != ESP_OK) {
    log_e("Failed to start Matter, err:%d", err);
    return;
  }
  sLifecycle = MatterLifecycle::StackStarted;
  {
    node_t *node = node::get();
    if (node != nullptr) {
      for (endpoint_t *ep = endpoint::get_first(node); ep != nullptr; ep = endpoint::get_next(ep)) {
        const uint16_t id = endpoint::get_id(ep);
        if (id == 0) {
          continue;
        }
        void *priv = endpoint::get_priv_data(id);
        if (priv == nullptr) {
          continue;
        }
        static_cast<MatterEndPoint *>(priv)->notifyStackStarted();
      }
    }
  }
#if CONFIG_ENABLE_MATTER_OVER_THREAD && defined(CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
  bindThreadNetworkCommissioningOnRoot();
#endif
#if defined(CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
  disableWiFiStationIfNotSelected();
#endif
  applyIdentityAfterStart();
  applyBlePolicyAfterStart();
#if CONFIG_ENABLE_CHIPOBLE
  if (sSelectedNetwork == MATTER_NETWORK_THREAD) {
    ensureChiPoBleAdvertising();
  }
#endif
  registerMatterIpEventHandler();
  if (selectedHasUsableIpv6()) {
#if CONFIG_ENABLE_MATTER_OVER_THREAD
    if (sSelectedNetwork == MATTER_NETWORK_THREAD) {
      startThreadAdvertiseRetries();
    } else
#endif
    {
      scheduleDnssdRestart();
    }
  }
}

// Network and Commissioning Capability Queries
bool ArduinoMatter::isWiFiStationEnabled() {
#ifdef SOC_WIFI_SUPPORTED
#ifdef CONFIG_ENABLE_WIFI_STATION
  return true;
#endif
#endif
  return false;
}

bool ArduinoMatter::isWiFiAccessPointEnabled() {
  // Check hardware support (SOC capabilities) AND Matter configuration
#ifdef SOC_WIFI_SUPPORTED
#if CHIP_DEVICE_CONFIG_ENABLE_WIFI_AP
  return true;
#else
  return false;
#endif
#else
  return false;
#endif
}

bool ArduinoMatter::isThreadEnabled() {
#ifdef CONFIG_ENABLE_MATTER_OVER_THREAD
  return true;
#else
  return false;
#endif
}

bool ArduinoMatter::isEthernetEnabled() {
#ifdef CONFIG_ETH_ENABLED
  return true;
#else
  return false;
#endif
}

bool ArduinoMatter::isNetworkSupported(matterNetwork_t network) {
  switch (network) {
    case MATTER_NETWORK_WIFI:     return isWiFiStationEnabled();
    case MATTER_NETWORK_THREAD:   return isThreadEnabled();
    case MATTER_NETWORK_ETHERNET: return isEthernetEnabled();
    default:                      return false;
  }
}

bool ArduinoMatter::selectNetwork(matterNetwork_t network) {
  const bool disableBle = (network == MATTER_NETWORK_ETHERNET);
  return selectNetwork(network, disableBle);
}

bool ArduinoMatter::selectNetwork(matterNetwork_t network, bool disableBLECommissioning) {
  if (sLifecycle != MatterLifecycle::Uninitialized) {
    log_e("Matter.selectNetwork() must be called before any accessory begin().");
    return false;
  }
  if (network == MATTER_NETWORK_NONE) {
    sSelectedNetwork = MATTER_NETWORK_NONE;
    return true;
  }
  if (!isNetworkSupported(network)) {
    log_e("Matter.selectNetwork(): network %d is not supported on this target.", static_cast<int>(network));
    return false;
  }
#if !CONFIG_ENABLE_CHIPOBLE
  if (network == MATTER_NETWORK_THREAD) {
    log_e("Thread selected but CHIPoBLE is not compiled in. Commission only if the sketch provisions a Thread dataset.");
  }
#endif
  sSelectedNetwork = network;
  if (disableBLECommissioning) {
    if (!setBLECommissioningEnabled(false)) {
      log_w("Matter.selectNetwork(): could not disable CHIPoBLE.");
    }
  }
  return true;
}

matterNetwork_t ArduinoMatter::getSelectedNetwork() {
  return sSelectedNetwork;
}

matterNetwork_t ArduinoMatter::getActiveNetwork() {
  if (sSelectedNetwork != MATTER_NETWORK_NONE && selectedHasUsableIpv6()) {
    return sSelectedNetwork;
  }
  if (netifHasUsableIpv6("WIFI_STA_DEF")) {
    return MATTER_NETWORK_WIFI;
  }
  if (netifHasUsableIpv6("OT_DEF")) {
    return MATTER_NETWORK_THREAD;
  }
  if (ethernetHasUsableIpv6()) {
    return MATTER_NETWORK_ETHERNET;
  }
  return MATTER_NETWORK_NONE;
}

uint16_t ArduinoMatter::getNetworkEndPointId(matterNetwork_t network) {
  switch (network) {
    case MATTER_NETWORK_WIFI:
      if (!isWiFiStationEnabled()) {
        return 0xFFFF;
      }
#if defined(CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
      if (sSelectedNetwork == MATTER_NETWORK_THREAD) {
        return 0xFFFF;
      }
#endif
      return 0;
    case MATTER_NETWORK_THREAD:
      if (!isThreadEnabled()) {
        return 0xFFFF;
      }
#if defined(CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION) && CHIP_DEVICE_CONFIG_ENABLE_WIFI_STATION
      // C6: Thread NC is on endpoint 0 only after selectNetwork(MATTER_NETWORK_THREAD).
      if (sSelectedNetwork == MATTER_NETWORK_THREAD) {
        return 0;
      }
      return 0xFFFF;
#endif
      return 0;
    case MATTER_NETWORK_ETHERNET:
    default:                      return 0xFFFF;
  }
}

