espressif/arduino-esp32/libraries/Matter/src/Matter.cpp
bool ArduinoMatter::waitForNetwork(uint32_t timeoutMs) {
  const uint32_t start = millis();
  while (true) {
    if (selectedHasUsableIpv6()) {
      return true;
    }
    if ((millis() - start) >= timeoutMs) {
      return false;
    }
    delay(50);
  }
}

bool ArduinoMatter::setBLECommissioningEnabled(bool enabled) {
  if (!ensureSetBeforeBegin("setBLECommissioningEnabled")) {
    return false;
  }
#if !CONFIG_ENABLE_CHIPOBLE
  if (enabled) {
    log_e("Matter.setBLECommissioningEnabled(true) is not supported; CHIPoBLE is not compiled in.");
    return false;
  }
  sBleCommissioningEnabled = false;
  return true;
#else
  sBleCommissioningEnabled = enabled;
  return true;
#endif
}

bool ArduinoMatter::isBLECommissioningEnabled() {
#if CONFIG_ENABLE_CHIPOBLE
  return sBleCommissioningEnabled;
#else
  return false;
#endif
}

bool ArduinoMatter::setBLEMemoryReleaseEnabled(bool enabled) {
  if (!ensureSetBeforeBegin("setBLEMemoryReleaseEnabled")) {
    return false;
  }
#if !CONFIG_ENABLE_CHIPOBLE
  if (!enabled) {
    log_e("Matter.setBLEMemoryReleaseEnabled(false) has no effect; CHIPoBLE is not compiled in.");
    return false;
  }
  return true;
#else
  sBleMemoryReleaseEnabled = enabled;
  return true;
#endif
}

bool ArduinoMatter::isBLEMemoryReleaseEnabled() {
  return isBLECommissioningEnabled() && sBleMemoryReleaseEnabled;
}

void ArduinoMatter::applyBlePolicyAfterStart() {
  // CHIPoBLE off: free BLE at begin() (on-network). CHIPoBLE on and already
  // commissioned: honor setBLEMemoryReleaseEnabled(). First-time CHIPoBLE
  // commission uses kCommissioningComplete instead.
  if (!isBLECommissioningEnabled() || (isDeviceCommissioned() && isBLEMemoryReleaseEnabled())) {
    scheduleShutdownChipBle();
  }
}

bool ArduinoMatter::isDeviceCommissioned() {
  return chip::Server::GetInstance().GetFabricTable().FabricCount() > 0;
}

bool ArduinoMatter::isWiFiConnected() {
  return chip::DeviceLayer::ConnectivityMgr().IsWiFiStationConnected();
}

bool ArduinoMatter::isThreadConnected() {
  return chip::DeviceLayer::ConnectivityMgr().IsThreadAttached();
}

bool ArduinoMatter::isDeviceConnected() {
  return ArduinoMatter::isWiFiConnected() || ArduinoMatter::isThreadConnected() || ethernetHasUsableIpv6();
}

void ArduinoMatter::decommission() {
  esp_matter::factory_reset();
}

// Global Matter Object
ArduinoMatter Matter;

#endif /* CONFIG_ESP_MATTER_ENABLE_DATA_MODEL */
